

using System;
using БиблиотекаОкно;

namespace БиблиотекаОперации
{
    public class ОбработкаКоманд
    {
        //public static void ЗаполнитьЗонуОкна3(String ДиректорияЗапуска)
        //{
        //    ГрафикаОкна.ОтрисоватьЗонуОкна(ПараметрыЗоны.ТочкаСлеваДляЗоны3, ПараметрыЗоны.ТочкаСверхуДляЗоны3, ПараметрыЗоны.ШиринаЗоны3, ПараметрыЗоны.ВысотаЗоны3);
        //    Console.SetCursorPosition(ПараметрыЗоны.ТочкаСлеваДляЗоны3 + 1, ПараметрыЗоны.ТочкаСверхуДляЗоны3 + ПараметрыЗоны.ВысотаЗоны3 / 2);
        //    Console.Write(ДиректорияЗапуска + " ► ");
        //}
    }
}
